
## Questions
question.service.name=Question Service
questions.locations.prompt.audio=Voc\u00EA receber\u00E1 um determinado local ou uma lista de locais pr\u00F3ximos de um usu\u00E1rio (em formato JSON),  obtidos a partir da API do google maps. \
  Al\u00E9m disso, tamb\u00E9m receber\u00E1 uma pergunta e sua tarefa \u00E9 gerar uma resposta objetiva e factual com base nos pontos tur\u00EDsticos recebidos ou seu \
  conhecimento geral sobre o(s) local(is) recebido(s). \
  #### RESTRI\u00C7\u00D5ES: \
  1. Se for enviada uma pergunta inv\u00E1lida, voc\u00EA deve responder: "Desculpe, mas sua pergunta n\u00E3o est\u00E1 clara. Por favor, forne\u00E7a mais detalhes ou fa\u00E7a uma nova pergunta. \
  2. Se JSON estiver nulo: responder a pergunta com base no conhecimento do pr\u00F3prio chat GPT. \
  3. Se no JSON o campo "name" n\u00E3o rela\u00E7\u00E3o com o campo "wikipediaDescription", pode desconsiderar a descri\u00E7\u00E3o do "wikipediaDescription", pois ela \u00E9 inv\u00E1lida. \
  4. Se o campo "wikipediaDescription" for inv\u00E1lido ou nulo, voc\u00EA dever\u00E1 gerar uma resposta considerando apenas o conhecimento do pr\u00F3prio chat GPT sobre o(s) local(is). \
  5. Se receber pergunta solicitando indica\u00E7\u00F5es de locais para visitar, lanchar ou dormir, avaliar o campo "locationTypes" no JSON e indicar um local da lista que tenha rela\u00E7\u00E3o com a pergunta considerando o de maior classifica\u00E7\u00E3o. \
  6. Ao indicar um local, criar um texto de f\u00E1cil leitura para envolver o usu\u00E1rio, contendo: nome do local, endere\u00E7o, avalia\u00E7\u00E3o e hor\u00E1rio de funcionamento. \
  7. Se n\u00E3o for encontrado ponto tur\u00EDstico relacionado \u00E0 quest\u00E3o, reponser: Desculpe, mas pr\u00F3ximo a voc\u00EA n\u00E3o h\u00E1 nenhum local relacionado \
  8. Entre cada cada item (nome do local, endere\u00E7o, avalia\u00E7\u00E3o e hor\u00E1rio de funcionamento) sempre deixar uma linha em branco para indicar ao speech-to-text uma pausa na leitura.\
  9. Ajuste as frases para que a transcri\u00E7\u00E3o delas para audio fique o mais natural poss\u00EDvel e respeitando as pontua\u00E7\u00F5es necess\u00E1rias. \
  10. A resposta dever\u00E1 ser retornada em um JSON com a seguinte estrutura: {0} \
  11. No JSON da resposta, preencher o campo "idLocation" com o valor do campo "id" no JSON recebido. Somente preencher esse campo caso sua resposta seja referente a um local espec\u00EDfico. \
  12. N\u00E3o inclua formata\u00E7\u00E3o adicional como ```json``` ou ``` em torno do JSON gerado. Apenas retorne o JSON puro. \
  #### JSON COM INFORMA\u00C7\u00D5ES GERAIS: {1} \
  #### PERGUNTA: {2}

questions.locations.prompt.text=Voc\u00EA receber\u00E1 um determinado local ou uma lista de locais pr\u00F3ximos de um usu\u00E1rio (em formato JSON),  obtidos a partir da API do google maps. \
  Al\u00E9m disso, tamb\u00E9m receber\u00E1 uma pergunta e sua tarefa \u00E9 gerar uma resposta objetiva e factual com base nos pontos tur\u00EDsticos recebidos ou seu \
  conhecimento geral sobre o(s) local(is) recebido(s). \
  #### RESTRI\u00C7\u00D5ES: \
  1. Se for enviada uma pergunta inv\u00E1lida, voc\u00EA deve responder: "Desculpe, mas sua pergunta n\u00E3o est\u00E1 clara. Por favor, forne\u00E7a mais detalhes ou fa\u00E7a uma nova pergunta. \
  2. Se JSON estiver nulo: responder a pergunta com base no conhecimento do pr\u00F3prio chat GPT. \
  3. Se no JSON o campo "name" n\u00E3o rela\u00E7\u00E3o com o campo "wikipediaDescription", pode desconsiderar a descri\u00E7\u00E3o do "wikipediaDescription", pois ela \u00E9 inv\u00E1lida. \
  4. Se o campo "wikipediaDescription" for inv\u00E1lido ou nulo, voc\u00EA dever\u00E1 gerar uma resposta considerando apenas o conhecimento do pr\u00F3prio chat GPT sobre o(s) local(is). \
  5. Se receber pergunta solicitando indica\u00E7\u00F5es de locais para visitar, lanchar ou dormir, avaliar o campo "locationTypes" no JSON e indicar um local da lista que tenha rela\u00E7\u00E3o com a pergunta considerando o de maior classifica\u00E7\u00E3o. \
  6. Ao indicar um local, criar um texto de f\u00E1cil leitura para envolver o usu\u00E1rio, contendo: nome do local, endere\u00E7o, avalia\u00E7\u00E3o e hor\u00E1rio de funcionamento. \
  7. Se n\u00E3o for encontrado ponto tur\u00EDstico relacionado \u00E0 quest\u00E3o, reponser: Desculpe, mas pr\u00F3ximo a voc\u00EA n\u00E3o h\u00E1 nenhum local relacionado \
  8. Formatar o texto de resposta para proporcionar uma leitura agrad\u00E1vel. \
  9. A resposta derevar ser retornada dentro de um JSON com a seguinte estrutura: {0} \
  10. No JSON da resposta, preencher o campo "idLocation" com o valor do campo "id" no JSON recebido. Somente preencher esse campo caso sua resposta seja referente a um local espec\u00EDfico. \
  11. N\u00E3o inclua formata\u00E7\u00E3o adicional como ```json``` ou ``` em torno do JSON gerado. Apenas retorne o JSON puro. \
  #### JSON COM INFORMA\u00C7\u00D5ES GERAIS: {1} \
  #### PERGUNTA: {2}

questions.identify.question.type=Voc\u00EA receber\u00E1 uma pergunta, e sua tarefa \u00E9 determinar a qual categoria entre as op\u00E7\u00F5es listadas abaixo essa pergunta est\u00E1 relacionada. \
  #### Responda apenas com uma das seguintes palavras: restaurant, hotel, tourist_attraction ou empty \
  CONDI\u00C7\u00D5ES: \
  1. restaurant: Se a pergunta estiver relacionada a comida, pizza, hamb\u00FArguer, almo\u00E7o, jantar, bebida, lanche, comer, beber ou qualquer coisa que remeta a restaurantes ou lanchonetes. \
  2. hotel: Se a pergunta estiver relacionada a acomoda\u00E7\u00E3o, hospedagem, hot\u00E9is, hotelaria, dormir, cansa\u00E7o ou qualquer coisa que remeta a esse tema. \
  3. tourist_attraction: Se a pergunta estiver relacionada a cultura, hist\u00F3ria, turismo, pontos tur\u00EDsticos ou atra\u00E7\u00F5es tur\u00EDsticas. \
  4. empty: Se a pergunta for gen\u00E9rica ou n\u00E3o estiver relacionada a nenhuma das categorias acima. \
  #### PERGUNTA: {0}

questions.identify.question.type2=Voc\u00EA receber\u00E1 um ARRAY de locais pr\u00F3ximos do usu\u00E1rio obtidos do Google Maps, al\u00E9m de uma 'Pergunta'. Sua tarefa \u00E9 determinar \
  se a pergunta tem rela\u00E7\u00E3o com algum(s) do(s) ponto(s) tur\u00EDsticos da lista. \
  #### RESTRI\u00C7\u00D5ES: \
  1. A resposta deve ser um Array com o identificador dos pontos tur\u00EDsticos relacionados \u00E0 pergunta. \
  2. Se a pergunta n\u00E3o tiver rela\u00E7\u00E3o com os pontos tur\u00EDsticos, retorne um Array vazio. Exemplo: [] \
  3. Se a pergunta tive rela\u00E7\u00E3o com todos os pontos tur\u00EDsticos ou for uma pergunta gen\u00E9rica que n\u00E3o especifique o nome dos pontos tur\u00EDsticos, retorne um array com todos os pontos tur\u00EDsticos. \
  #### PONTOS TURISTICOS: {0} \
  #### PERGUNTA: {1}

questions.identify.locations.type.based.on.question=Voc\u00EA receber\u00E1 um ARRAY de tipos de locais do Google Maps, al\u00E9m de uma 'Pergunta'. Sua tarefa \u00E9 determinar \
  a quais tipos dos locais a pergunta est\u00E1 relacionada e retornar um array como resposta. \
  #### RESTRI\u00C7\u00D5ES: \
  1. A resposta deve ser um Array com o identificador dos tipos relacionados \u00E0 pergunta. \
  2. Se a pergunta n\u00E3o tiver rela\u00E7\u00E3o com os tipos, retorne um Array vazio. Exemplo: [] \
  3. Se n\u00E3o for poss\u00EDvel deduzir os tipos com base na pergunta, retornar o array com todos os tipos recebidos.
  #### EXEMPLO: \
  1. Pergunta Recebida: Qual o melhor local para comer uma pizza com a fam\u00EDlia? \
  2. Array Recebido: ["restaurant", "museum", "food", "lodging", "bar"] \
  3. Array de resposta: ["restaurant", "food"] \
  #### ARRAY: {0} \
  #### PERGUNTA: {1}

questions.nearby.location.not.found=N\u00E3o foi poss\u00EDvel encontrar um local pr\u00F3ximo a voc\u00EA relacionado a pergunta enviada. Tente novamente.
questions.not.possible.understand.audio=N\u00E3o foi poss\u00EDvel entender o audio enviado. Verifique a qualidade da grava\u00E7\u00E3o e tente novamente.
questions.error.converts.openai.response.to.list=Erro ao converter resposta do openai para lista de strings

## Open AI
openai.service.name=OpenAI Service
openai.generate.location.short.description.prompt=###Voc\u00EA receber\u00E1 o nome de um ponto tur\u00EDstico. \
  Sua tarefa \u00E9 gerar um texto de apresenta\u00E7\u00E3o dese local para o usu\u00E1rio.  \
  Considere as seguintes restri\u00E7\u00F5es: \
  1. O objetivo do texto \u00E9 apenas apresentar os nomes em uma linguagem mais humana. \
  2. O texto deve conter apenas o nome dos locais e mais algums poucas palavras que o torne apresentativo e convidativo para visita\u00E7\u00E3o em uma linguagem mais humana.  \
  3. O texto deve ser ideal para leitura de no m\u00E1ximo 30 segundos. \
  ### Exemplo: \
  1. Exemplo de Local recebido: 'Cristo Redentor' \
  2. Exemplo de Resposta: Pr\u00F3ximo a voc\u00EA est\u00E1 o Cristo Redentor, um dos pontos tur\u00EDsticos mais famosos do Rio de Janeiro. Venha conhecer mais de perto esse cart\u00E3o postal da cidade carioca. \
  ### PONTO TURISTICO: {0}

#TODO: Talvez o texto abaixo n\u00E3o seja necess\u00E1rio chamada \u00E0 API da  openAI.
openai.generate.locations.short.description.prompt=###Voc\u00EA receber\u00E1 uma lista de pontos tur\u00EDsticos em formato JSON. \
  Sua tarefa \u00E9 gerar um texto de apresenta\u00E7\u00E3o desses locais para o usu\u00E1rio.  \
  Considere as seguintes restri\u00E7\u00F5es: \
  1. O texto deve come\u00E7ar com a frase: Pr\u00F3ximo a voc\u00EA est\u00E3o alguns dos pontos tur\u00EDsticos mais admir\u00E1veis da cidade. Quer saber mais? Quer saber mais sobre pontos tur\u00EDsticos, hoteis ou restaurantes? Fa\u00E7a uma pergunta e ficarei feliz em ajud\u00E1-lo. \
  2. O objetivo do texto \u00E9 apenas apresentar os nomes em uma linguagem mais humana. \
  3. O texto deve ser ideal para leitura de no m\u00E1ximo 30 segundos. \
  4. Se n\u00E3o houver pontos tur\u00EDsticos na lista, retornar: N\u00E3o h\u00E1 pontos tur\u00EDsticos pr\u00F3ximos a voc\u00EA no momento. \
  5. Se houver pontos tur\u00EDsticos na lista, retornar: Pr\u00F3ximo a voc\u00EA est\u00E3o alguns dos principais pontos tur\u00EDsticos da cidade. Quer saber mais? Seja sobre pontos tur\u00EDsticos, hoteis ou restaurantes, fa\u00E7a uma pergunta e ficarei feliz em ajud\u00E1-lo. \
  ### JSON: {0}

openai.find.location.name=Dado o JSON a seguir encontre o t\u00EDtulo correto do/da {0}.\
  #### ORIENTA\u00C7\u00D5ES: \
  1. Se encontrar, retornar apneas o t\u00EDtulo exato.\
  2. Se n\u00E3o encontrar, reponda apenas com a palavra chave "NOT_FOUND"\
  #### JSON: {1}

## Wikipedia API
wikipedia.service.name=Integra\u00E7\u00E3o Wikipedia
wikipedia.title.not.found=Nenhum artigo encontrado para o t\u00EDtulo ''{0}''.
wikipedia.search.title.error=Erro ao buscar artigo para o t\u00EDtulo ''{0}''.

##Error
json.err.convert.object.to.string=An error was occurred on process Object to JSON String. Details: {0}
json.err.convert.string.to.object=An error was occurred on process JSON String to Object of type ''{0}''.

##Integrations
integrations.request=Request: {0}
integrations.response=Response: {0}
integrations.error.consumer.service=Falha ao processar requisi\u00E7\u00E3o do servi\u00E7o ''{0}''. Foi(ram) realizada(s) {1} tentativa(s) de {2}. Detalhes: {3}
integrations.error.consumer.service.exit=Falha ao processar requisi\u00E7\u00E3o do servi\u00E7o ''{0}''. Foi(ram) realizada(s) {1} tentativa(s) de {2}.

## Scraping Service
scraping.service.name=Scraping Service

## Places Services
google.places.service.name=Google Places Service

## Speech to Text Service
speechtotext.service.name=Speech To Text

## Text to Speech
texttospeech.service.name=Text To Speech

## Geocode
geocode.service.name=Google Geocode